```terraform
[command]/home/runner/work/_temp/3ee25493-d250-4e11-ae1d-9b2121d5bd19/terraform-bin plan -out=environment.tfplan -no-color
module.vpc.data.aws_security_group.ec2_public[0]: Reading...
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
module.vpc.data.aws_subnet.private_1[0]: Reading...
module.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1ENRFIZYLVUVH]
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.vpc.data.aws_subnet.public_2[0]: Reading...
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]
module.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]
module.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...
module.vpc.data.aws_subnet.public_1[0]: Reading...
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...
module.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnet.private_2[0]: Reading...
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.vpc.data.aws_vpc.default: Reading...
module.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=791901361445]
data.aws_ssm_parameter.route53_zone_id: Reading...
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
module.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]
data.aws_ssm_parameter.route53_hosted_zone: Reading...
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
data.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]
aws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]
module.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]
module.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-2Z2LHH5U44AMVEUC5KQ34Y4MHA]
module.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/e667d549-0230-491a-9fb3-ff620beb6361]
module.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]
module.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]
module.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]
module.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-01-16 05:21:14.339 +0000 UTC]
module.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=EUYAGYQTRL1WL]
module.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2GZMTIUVXE6U8]
module.app[0].aws_route53_record.main: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]
module.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]
module.app[0].aws_route53_record.www: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.rds.aws_db_instance.secure[0] will be updated in-place
  ~ resource "aws_db_instance" "secure" {
      + final_snapshot_identifier             = (known after apply)
        id                                    = "db-2Z2LHH5U44AMVEUC5KQ34Y4MHA"
      ~ skip_final_snapshot                   = true -> false
        tags                                  = {}
        # (51 unchanged attributes hidden)
    }

  # module.s3.aws_s3_bucket.data_interview_video will be created
  + resource "aws_s3_bucket" "data_interview_video" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "staging-data-interview-video"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket.data_question_response_audio will be created
  + resource "aws_s3_bucket" "data_question_response_audio" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "staging-data-question-response-audio"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_cors_configuration.data_interview_video will be created
  + resource "aws_s3_bucket_cors_configuration" "data_interview_video" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.s3.aws_s3_bucket_cors_configuration.data_question_response_audio will be created
  + resource "aws_s3_bucket_cors_configuration" "data_question_response_audio" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.s3.aws_s3_bucket_policy.data_interview_video will be created
  + resource "aws_s3_bucket_policy" "data_interview_video" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.data_question_response_audio will be created
  + resource "aws_s3_bucket_policy" "data_question_response_audio" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_public_access_block.data_interview_video will be created
  + resource "aws_s3_bucket_public_access_block" "data_interview_video" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.s3.aws_s3_bucket_public_access_block.data_question_response_audio will be created
  + resource "aws_s3_bucket_public_access_block" "data_question_response_audio" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: environment.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "environment.tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.vpc.data.aws_security_group.ec2_public[0]: Reading...%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.vpc.data.aws_subnet.private_1[0]: Reading...%0Amodule.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1ENRFIZYLVUVH]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.vpc.data.aws_subnet.public_2[0]: Reading...%0Amodule.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...%0Amodule.vpc.data.aws_subnet.public_1[0]: Reading...%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]%0Adata.aws_region.current: Reading...%0Adata.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.vpc.data.aws_subnet.private_2[0]: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_caller_identity.current: Read complete after 0s [id=791901361445]%0Adata.aws_ssm_parameter.route53_zone_id: Reading...%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]%0Adata.aws_ssm_parameter.route53_hosted_zone: Reading...%0Amodule.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Adata.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Adata.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]%0Aaws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-2Z2LHH5U44AMVEUC5KQ34Y4MHA]%0Amodule.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.app[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/e667d549-0230-491a-9fb3-ff620beb6361]%0Amodule.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0Amodule.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]%0Amodule.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]%0Amodule.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-01-16 05:21:14.339 +0000 UTC]%0Amodule.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=EUYAGYQTRL1WL]%0Amodule.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2GZMTIUVXE6U8]%0Amodule.app[0].aws_route53_record.main: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]%0Amodule.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]%0Amodule.app[0].aws_route53_record.www: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.rds.aws_db_instance.secure[0] will be updated in-place%0A  ~ resource "aws_db_instance" "secure" {%0A      + final_snapshot_identifier             = (known after apply)%0A        id                                    = "db-2Z2LHH5U44AMVEUC5KQ34Y4MHA"%0A      ~ skip_final_snapshot                   = true -> false%0A        tags                                  = {}%0A        # (51 unchanged attributes hidden)%0A    }%0A%0A  # module.s3.aws_s3_bucket.data_interview_video will be created%0A  + resource "aws_s3_bucket" "data_interview_video" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "staging-data-interview-video"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket.data_question_response_audio will be created%0A  + resource "aws_s3_bucket" "data_question_response_audio" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "staging-data-question-response-audio"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_cors_configuration.data_interview_video will be created%0A  + resource "aws_s3_bucket_cors_configuration" "data_interview_video" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + cors_rule {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket_cors_configuration.data_question_response_audio will be created%0A  + resource "aws_s3_bucket_cors_configuration" "data_question_response_audio" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + cors_rule {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.data_interview_video will be created%0A  + resource "aws_s3_bucket_policy" "data_interview_video" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.data_question_response_audio will be created%0A  + resource "aws_s3_bucket_policy" "data_question_response_audio" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.data_interview_video will be created%0A  + resource "aws_s3_bucket_public_access_block" "data_interview_video" {%0A      + block_public_acls       = false%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = false%0A      + restrict_public_buckets = false%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.data_question_response_audio will be created%0A  + resource "aws_s3_bucket_public_access_block" "data_question_response_audio" {%0A      + block_public_acls       = false%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = false%0A      + restrict_public_buckets = false%0A    }%0A%0APlan: 8 to add, 1 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: environment.tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "environment.tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```